2.3.Pruebas-de-servicios-web/tema8/Artillery/artillery_ejem9/ejem9.yml
config:
  target: "ws://localhost:8080/chat"
  processor: "./addTimeStamp.js"
  phases:
    - duration: 20
      arrivalRate: 2
scenarios:
  - engine: "ws"
    flow:
      - loop:
        - function: "addTimeStamp"
        - send: 
            message: "Hi everybody"
            timeStamp: "{{ timeStamp }}"
        - think: 1
        count: 100